In [6]:
from config import password
import pandas as pd

In [7]:
from sqlalchemy import create_engine
engine = create_engine(f'postgresql://postgres:{password}@localhost:5432/pewlett_hackard')
conn = engine.connect()

In [10]:
employee_df = pd.read_sql("SELECT * FROM employees", conn)
title_df = pd.read_sql("SELECT * FROM titles", conn)

In [9]:
employee_df

        emp_no emp_title  birth_date   first_name  last_name sex   hire_date
0       473302     s0001   7/25/1953     Hideyuki   Zallocco   M   4/28/1990
1       475053     e0002  11/18/1954        Byong  Delgrande   F    9/7/1991
2        57444     e0002   1/30/1958        Berry       Babb   F   3/21/1992
3       421786     s0001   9/28/1957        Xiong   Verhoeff   M  11/26/1987
4       282238     e0003  10/28/1952   Abdelkader    Baumann   F   1/18/1991
...        ...       ...         ...          ...        ...  ..         ...
300019  464231     s0001   8/14/1958  Constantino    Eastman   M  10/28/1988
300020  255832     e0002    5/8/1955       Yuping     Dayang   F   2/26/1995
300021   76671     s0001    6/9/1959       Ortrud   Plessier   M   2/24/1988
300022  264920     s0001   9/22/1959        Percy   Samarati   F    9/8/1994
300023  464503     s0002   5/31/1964       Arvind  Slobodova   M  11/23/1987

[300024 rows x 7 columns]

In [11]:
title_df

  title_id               title
0    s0001               Staff
1    s0002        Senior Staff
2    e0001  Assistant Engineer
3    e0002            Engineer
4    e0003     Senior Engineer
5    e0004    Technique Leader
6    m0001             Manager